3er-version-mysql-springSOAPProducing/src/main/resources/webservice2-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/ex4/webservice">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:ReservationRequest>
         <gs:login>karim</gs:login>
         <gs:password>dahdouh</gs:password>
         <gs:idOffre>50_06-03-2020</gs:idOffre>
         <gs:idOffre>50_06-03-2020</gs:idOffre>
         <gs:client>
        		<gs:id>13</gs:id>
        		<gs:nom>Theirno</gs:nom>
        		<gs:prenom>Barry</gs:prenom>
        		<gs:carteCredit>400999582383472</gs:carteCredit>
         </gs:client>
      </gs:ReservationRequest>
   </soapenv:Body>
 </soapenv:Envelope>