springSOAP/src/main/resources/hotel-request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://spring.io/ex4/webservice">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getHotelRequest>
         <gs:nom>Montpellier</gs:nom>
         <gs:dateDepart>2019-09-24</gs:dateDepart>
         <gs:dateArrivee>2020-01-24</gs:dateArrivee>
      </gs:getHotelRequest>
   </soapenv:Body>
</soapenv:Envelope>